# https://github.com/Homebrew/homebrew-bundle

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"

tap "romkatv/powerlevel10k"

# Homebrew
# https://github.com/Homebrew/brew/

# Need to install openssl before libyaml
brew "openssl"
brew "openssl@1.1" # wget dependency

brew "coreutils"
brew "go"
brew "tmux"
brew "wget"
brew "git"
brew "neovim"
brew "romkatv/powerlevel10k/powerlevel10k"
brew "terraform"
brew "terraform-ls"
brew "gopls"
brew "wget"
brew "jq"

# homebrew-cask
# https://github.com/caskroom/homebrew-cask
cask "protonvpn"
cask "1password"
cask "alfred"
cask "slack"
cask "skype"
cask "signal"
cask "tableplus"
cask "rapidapi"
cask "wireshark"
cask "vlc"
